<template>
  <section>
    <div class="container" style="max-width: 800px; margin-top: 40px">
      <h1>Как я выполнял это ТЗ</h1>

      <p>Разобрал задание и выбрал Nuxt в качестве фреймворка.</p>

      <p>
        Не особо понял, что вы хотите увидеть в графиках, поэтому сделал для них
        массив с тестовыми данными (как и для всех значений в этой таблице),
        которые имитируют запрос на сервер
      </p>

      <p>
        Для стилей использовал BEM и SCSS, так же глобальные переменные и scope
        для наглядности
      </p>

      <p>Добавил легкую анимацию используя модуль vue-use</p>

      <p>
        Для форматирования чисел использовал utils
        <i
          >для вычисления процента прибыли, так же сделал переиспользуемый
          компонент и использовал вычисляемые свойства</i
        >
      </p>

      <p>Каждый элемент сделал отдельным компонентом</p>

      <p>Использовал вычисляемые свойства там, где они должны быть</p>

      <p>
        Предположил, что тег <b>table</b> можно не использовать, поэтому сделал
        это на дивах без адаптива
      </p>

      <p>Использовал лэйауты и навигации, ClientOnly компоненты</p>

      <hr />

      <p><b>Затречно времени: </b>1 час 15 минут</p>
      <p>
        <b>Репозиторий: </b>
        <a href="https://github.com/xdianovx/delta-test" target="_blank"
          >delta test</a
        >
      </p>
    </div>
  </section>
</template>

<script lang="ts" setup></script>

<style></style>
